Tekla Open API Reference for Tekla Structures 2025
EdgeChamfer.EdgeChamferAttributes Class
 The EdgeChamferAttributes class is the attributes class for the edge chamfer.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.EdgeChamfer.EdgeChamferAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class EdgeChamferAttributes : AttributesBase
<SerializableAttribute>
Public NotInheritable Class EdgeChamferAttributes
	Inherits AttributesBase
The EdgeChamfer.EdgeChamferAttributes type exposes the following members.
Constructors
Name | Description
EdgeChamfer.EdgeChamferAttributes()
 Creates a new default edge chamfer attributes instance that loads standard attributes.
EdgeChamfer.EdgeChamferAttributes(String)
 Creates a new edge chamfer attributes instance that loads the specified attributes.
Top
Properties
Name | Description
VisibleLines
 The line type of the chamfer.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace